mhs/common/mhs_common/messages/tests/test_messages/ebxml_request_manifest_contains_filename_with_equals.xml

<soap:Envelope xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
			   xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0"
			   xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<eb:MessageHeader eb:version="2.0" soap:mustUnderstand="1">
			<eb:From>
				<eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">C88046-807354</eb:PartyId>
			</eb:From>
			<eb:To>
				<eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">P83007-822482</eb:PartyId>
			</eb:To>
			<eb:CPAId>d434c95b662b941a59f9</eb:CPAId>
			<eb:ConversationId>A0000131-351C-452F-BEDB-3ED4759A0800</eb:ConversationId>
			<eb:Service>urn:nhs:names:services:gp2gp</eb:Service>
			<eb:Action>RCMR_IN030000UK07</eb:Action>
			<eb:MessageData>
				<eb:MessageId>F01D21CB-31A3-49C6-B0FC-A64C858149AA</eb:MessageId>
				<eb:Timestamp>2024-12-10T08:02:33.405Z</eb:Timestamp>
				<eb:TimeToLive>2024-12-10T14:17:33.405Z</eb:TimeToLive>
			</eb:MessageData>
			<eb:DuplicateElimination />
		</eb:MessageHeader>
		<eb:AckRequested eb:version="2.0" soap:mustUnderstand="1"
						 soap:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH" eb:signed="false" />
	</soap:Header>
	<soap:Body>
		<eb:Manifest eb:version="2.0" soap:mustUnderstand="1">
			<eb:Reference xlink:href="cid:Content1@e-mis.com/EMISWeb/GP2GP2.2A"
						  xmlns:xlink="http://www.w3.org/1999/xlink">
				<eb:Description xml:lang="en">RCMR_IN030000UK07</eb:Description>
				<hl7ebxml:Payload style="HL7" encoding="XML" version="3.0" />
			</eb:Reference>
			<eb:Reference xlink:href="mid:E54DEC57-6BA5-40AB-ACD0-1E383209C034"
						  eb:id="_735BB673-D9C0-4B85-951E-98DD045C4713"
						  xmlns:xlink="http://www.w3.org/1999/xlink">
				<eb:Description xml:lang="en">
				Filename="735BB673-D9C0-4B85-951E-98DD045C4713_adrian=marbles2.BMP" ContentType=application/octet-stream Compressed=Yes LargeAttachment=No OriginalBase64=No Length=3345444
				</eb:Description>
			</eb:Reference>
		</eb:Manifest>
	</soap:Body>
</soap:Envelope>